// Тест 2: Промежуточный тест на закрепление знаний

// Вопрос 1: Какой из вариантов получения этого элемента со страницы будет правильным? <div id="hi">Hello</div>
// ответ: document.querySelector('#hi');
// вариант с .querySelectorAll будет неверным т.к. он даст доступ не к элементу а к псевдомассиву

// Вопрос 4: Что такое объект события?
// ответ: Это объект котрый содержит всю инфор-ю о произ-м событии

// Вопрос 8: Для чего существуют data-атрибуты?
// ответ: Для удобного ориент-я в элементах по их значению при помощи JS

// Вопрос 14: Как определить тип произошедшего события в обработчике?
// ответ: event.type



// 51. Ресурсы для оттачивания навыков программирования:

// https://www.codewars.com/ - международный сайт с поддержкой десятков языков программирования и задачек к ним. 
// Задания разделены на уровни сложности, их появляется все больше и больше. Удобный интерфейс тестирования решений, 
// проверки и сравнения с другими. И, конечно же, прокачка своего профиля по уровням. Рекомендую.

// https://leetcode.com/ - похожий на предыдущий, но обычно уже с более сложными задачами. По моему опыту, 
// тут больше упор на алгоритмы и их применение. Но и JS можно отлично потренировать.
// (Обычно этих двух хватает с головой, если честно)

// https://www.hackerrank.com/ - все тоже похоже. Сервис больше популярен в США, но это не мешает и нам тут потренироваться.

// freecodecamp - тут можно прорешать еще дополнительные задачки, если предыдущих мало 🙂

